config.org
* Package management
** Package archive servers
#+BEGIN_SRC  emacs-lisp
(require 'package)
(add-to-list 'package-archives '("melpa-stable" . "https://stable.melpa.org/packages/"))
(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/"))
(add-to-list 'package-archives '("org" . "https://orgmode.org/elpa/") t)
(setq use-package-always-pin  "melpa-stable")
(package-initialize)
#+END_SRC

** use-package
We must ensure use-package is installed every time. =eval-when-compile= helps emacs load faster.
#+BEGIN_SRC  emacs-lisp
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))
(eval-when-compile (require 'use-package))
#+END_SRC


* Theme
We only have to run a single line, thankfully
#+BEGIN_SRC  emacs-lisp
(add-to-list 'custom-theme-load-path "~/.emacs.d/cyberpunk/")
#+END_SRC
